docs: improve repository documentation and gihub community files
